app/Models/RegimeModel.php

    public function getRegimesAvecPourcentage(float $variationPoids): array
    {
        $model = new ActiviteModel();

        // Déterminer si on cherche des régimes de perte ou gain de poids
        $isWeightLoss = $variationPoids < 0;

        $regimes = [];
        $activites = [];

        if ($isWeightLoss) {
            $regimes = $this->where('variation_poids_kg <', 0)->findAll();
            $activites = $model->where('variation_poids_kg <', 0)->findAll();
---
SELECT *
FROM `regimes`
WHERE `variation_poids_kg` < 0
SELECT *
FROM `activites`
WHERE `variation_poids_kg` < 0